const svRegJ = [
  ...new Set([
    ...svRegH,

    // =========================
    // パルデア図鑑 H対象外 → Jで追加
    // =========================
    "イダイナキバ",
    "サケブシッポ",
    "アラブルタケ",
    "ハバタクカミ",
    "チヲハウハネ",
    "スナノケガワ",
    "テツノワダチ",
    "テツノツツミ",
    "テツノカイナ",
    "テツノコウベ",
    "テツノドクガ",
    "テツノイバラ",
    "チオンジェン",
    "パオジアン",
    "ディンルー",
    "イーユイ",
    "トドロクツキ",
    "テツノブジン",
    "コライドン",
    "ミライドン",

    // =========================
    // キタカミ図鑑 No.197〜200
    // =========================
    "イイネイヌ",
    "マシマシラ",
    "キチキギス",
    "オーガポン",

    // =========================
    // ブルーベリー図鑑 No.236〜243
    // =========================
    "ウガツホムラ",
    "タケルライコ",
    "テツノカシラ",
    "テツノイワオ",
    "テラパゴス",
    "ウネルミナモ",
    "テツノイサハ",
    "モモワロウ",

    // =========================
    // その他使用可能
    // =========================
    "フリーザー",
    "フリーザー（ガラルのすがた）",
    "サンダー",
    "サンダー（ガラルのすがた）",
    "ファイヤー",
    "ファイヤー（ガラルのすがた）",

    "ミュウツー",
    "ミュウ",

    "ライコウ",
    "エンテイ",
    "スイクン",
    "ルギア",
    "ホウオウ",

    "レジロック",
    "レジアイス",
    "レジスチル",

    "カイオーガ",
    "グラードン",
    "レックウザ",
    "ジラーチ",

    "デオキシス（ノーマルフォルム）",
    "デオキシス（アタックフォルム）",
    "デオキシス（ディフェンスフォルム）",
    "デオキシス（スピードフォルム）",

    "ユクシー",
    "エムリット",
    "アグノム",

    "ディアルガ",
    "ディアルガ（オリジンフォルム）",
    "パルキア",
    "パルキア（オリジンフォルム）",

    "ヒードラン",
    "レジギガス",

    "ギラティナ（アナザーフォルム）",
    "ギラティナ（オリジンフォルム）",

    "クレセリア",
    "フィオネ",
    "マナフィ",
    "ダークライ",

    "シェイミ（ランドフォルム）",
    "シェイミ（スカイフォルム）",

    "アルセウス",

    "コバルオン",
    "テラキオン",
    "ビリジオン",

    "トルネロス（けしんフォルム）",
    "トルネロス（れいじゅうフォルム）",
    "ボルトロス（けしんフォルム）",
    "ボルトロス（れいじゅうフォルム）",

    "レシラム",
    "ゼクロム",
    "ランドロス（けしんフォルム）",
    "ランドロス（れいじゅうフォルム）",

    "キュレム（キュレムのすがた）",
    "キュレム（ホワイトキュレム）",
    "キュレム（ブラックキュレム）",

    "ケルディオ（いつものすがた）",
    "ケルディオ（かくごのすがた）",
    "メロエッタ（ボイスフォルム）",

    "ディアンシー",
    "フーパ（いましめられしフーパ）",
    "フーパ（ときはなたれしフーパ）",
    "ボルケニオン",

    "コスモッグ",
    "コスモウム",
    "ソルガレオ",
    "ルナアーラ",

    "ネクロズマ",
    "ネクロズマ（たそがれのたてがみ）",
    "ネクロズマ（あかつきのつばさ）",

    "マギアナ",

    "ザシアン",
    "ザマゼンタ",
    "ムゲンダイナ",

    "ダクマ",
    "ウーラオス（いちげきのかた）",
    "ウーラオス（れんげきのかた）",

    "ザルード",

    "レジエレキ",
    "レジドラゴ",
    "ブリザポス",
    "レイスポス",

    "バドレックス",
    "バドレックス（はくばじょうのすがた）",
    "バドレックス（こくばじょうのすがた）",

    "ラブトロス（けしんフォルム）",
    "ラブトロス（れいじゅうフォルム）"
  ])
];


// =========================
// レギュレーションJ
// 「特別なポケモン」
// 1チーム2匹まで
// =========================

const svRegJSpecial = [
  "ミュウツー",
  "ミュウ",

  "ルギア",
  "ホウオウ",

  "カイオーガ",
  "グラードン",
  "レックウザ",
  "ジラーチ",

  "デオキシス（ノーマルフォルム）",
  "デオキシス（アタックフォルム）",
  "デオキシス（ディフェンスフォルム）",
  "デオキシス（スピードフォルム）",

  "ディアルガ",
  "ディアルガ（オリジンフォルム）",
  "パルキア",
  "パルキア（オリジンフォルム）",

  "ギラティナ（アナザーフォルム）",
  "ギラティナ（オリジンフォルム）",

  "フィオネ",
  "マナフィ",
  "ダークライ",

  "シェイミ（ランドフォルム）",
  "シェイミ（スカイフォルム）",

  "アルセウス",

  "レシラム",
  "ゼクロム",

  "キュレム（キュレムのすがた）",
  "キュレム（ホワイトキュレム）",
  "キュレム（ブラックキュレム）",

  "ケルディオ（いつものすがた）",
  "ケルディオ（かくごのすがた）",

  "メロエッタ（ボイスフォルム）",

  "ディアンシー",

  "フーパ（いましめられしフーパ）",
  "フーパ（ときはなたれしフーパ）",

  "ボルケニオン",

  "コスモッグ",
  "コスモウム",
  "ソルガレオ",
  "ルナアーラ",

  "ネクロズマ",
  "ネクロズマ（たそがれのたてがみ）",
  "ネクロズマ（あかつきのつばさ）",

  "マギアナ",

  "ザシアン",
  "ザマゼンタ",
  "ムゲンダイナ",

  "ザルード",

  "バドレックス",
  "バドレックス（はくばじょうのすがた）",
  "バドレックス（こくばじょうのすがた）",

  "コライドン",
  "ミライドン",
  "テラパゴス",
  "モモワロウ"
];
